module Constants
  TRANSLATE_LANGUAGE = ["ja", "en", "zh"]

  NOTICE_RETENTION_PERIOD = 7.days
  MESSAGE_RETENTION_PERIOD = 30.days

  DISTRIBUTE_RATIO = 0.005
  DISTRIBUTE_MIN = 100
  TAX_RATIO = 0.01
  TAX_MIN = 1

  PREMIUM_PRICE = 50000
  PREMIUM_LIMIT = 1.days

  STOCK_COMPANY_NAME_ELEMENTS = ["", "ニュース", "サービス", "スクラッチ", "テクノロジー", "ナビ", "オープン", "ロボティクス", "ネットワーク",
    "ネットワークス", "ヒューマン", "インタラクティブ", "マーケット", "マーケティング", "プラネット", "コネクテッド", "メディア", "オプト",
    "マイスター", "ネクスト", "バイオ", "ケミカル", "テック", "フォース", "アセット", "ナレッジ", "マーチャント", "ワークス", "スタンダード",
    "エージェント", "マネー", "インサイド", "リンク", "アンド", "モチベーション", "スタイル", "デザイン", "ペイ", "ジャパン", "パワー",
    "マテリアル", "デバイス", "オプティ", "マインド", "ネット", "ビット", "エナジー", "キャリア", "ヘルスケア", "ピクセル", "メモリ", "ハウス",
    "スペース", "フィールド", "スマート", "ドライブ", "システム", "システムズ", "リンク", "サイエンス", "クレジット", "ワークス", "コム",
    "ケミカル", "コンセプト", "インフォ", "インターネット", "イー", "デジタル", "クリエイト", "クラウド", "フューチャー", "ユニバーサル" ]

  STOCK_COMPANY_NAME_ELEMENTS_AFTER = ["工業", "重工業", "興業", "鋼業", "化学", "電力", "電気", "電機", "技研", "研究所", "交通", "証券",
    "ホールディングス", "グループ", "カンパニー", "コーポレーション", "キャピタル", "サービス", "エレクトロニクス", "セミコンダクター",
    "フーズ", "ペイ", "ラボ", "モバイル", "エンジニアリング", "リテイリング", "バンク", "ドットコム", "エンターテインメント", "ロジスティクス",
    "企画", "開発"]

  CARD_ZOMBIE = "ゾンビー"
  CARD_PRICE = 1000
  CARD_PACK = 5
  CARD_BOX_EXPAND_PRICE = 1000
  CARD_SEND_PRICE = 1000
  CARD_JUDGE_PRICE = 1000

  CARD_PRIZE = 1000
  CARD_DESTROY_RATIO = 0.2
  CARD_HOF_COUNT = 30

  CARD_RULE = [300, 200, 100]
  CARD_RULE_NAME = ["スーパーヘビー級", "ヘビー級", "ジュニア級"]
  CARD_ELEMENTS = ["無", "木", "火", "土", "金", "水", "光", "闇", "全", "？", "虚", "神"]
  CARD_ELEMENTALS = ["カオス", "青龍", "朱雀", "麒麟", "白虎", "玄武", "アマテラス", "ツクヨミ", "コスモス", "正体不明", "真理", "宣言"]

  CARD_EFFFECT = [ [0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0],
                   [0, 0,-1, 1, 0, 0, 1, 0, 0, 1, 1, 0],
                   [0, 0, 0,-1, 1, 0, 1, 0, 0, 1, 1, 0],
                   [0, 0, 0, 0,-1, 1, 1, 0, 0, 1, 1, 0],
                   [0, 1, 0, 0, 0,-1, 1, 0, 0, 1, 1, 0],
                   [0,-1, 1, 0, 0, 0, 1, 0, 0, 1, 1, 0],
                   [0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1, 0],
                   [0, 1, 1, 1, 1, 1, 0, 0, 0, 1, 1, 0],
                   [0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0],
                   [-1,-1,-1,-1,-1,-1,-1,-1,-1, 0,-1,-1],
                   [0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1],
                   [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0] ]

  CARD_ENVIRONMENT = [ [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
                       [0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
                       [0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0],
                       [0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0],
                       [0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0],
                       [0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0],
                       [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
                       [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
                       [0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0],
                       [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
                       [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
                       [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] ]

  TIRAMON_NAME = "野生のチラモン"

  TIRAMON_MP_DAMAGE = [5.0, 10.0]
  TIRAMON_RECOVER_RATIO = [0.10, 0.05, 0.20]

  TIRAMON_ELEMENTS = ["打", "投", "極", "無"]

  TIRAMON_MOTIVATION = [
    ["あからさまにやる気がなさそうだ", "舐めてかかっている"],
    ["やる気がなさそうだ", "油断している"],
    ["落ち着いている", "冷静に相手を見据えている"],
    ["やる気がありそうだ！", "油断はない！"],
    ["やる気が満ち溢れている！！", "眼光は鋭い！！"],
    ["やる気が爆発しそうだ！！！", "その眼は闘志で燃え上がっている！！！"],
  ]
  TIRAMON_RISK = [
    ["様子見の攻撃！"],
    ["着実な攻撃！"],
    ["果敢に攻める！"],
    ["大技を狙っている…！"],
    ["大技を狙っている！", "これはもらってはいけない！", "試合の流れを変える一撃！"],
    ["超大技を狙っている！！", "決まれば試合終了は必至だ！！", "これで決まるか！！"],
    ["奥の手を狙っている！！！", "必殺の一撃を狙う！！！", "フィニッシュ宣言！！！", "試合を終わらせるつもりだ！！！"],
  ]

  TIRAMON_HIT_RATE_PURORESU = [
    ["無謀な攻め！！！"],
    ["仕掛けが早すぎる！！"],
    ["強引に行った！"],
    ["決まるか…！"],
    ["決めに行った！"],
    ["確実に決めに行った！！"],
    ["満を持して！！！"],
  ]
  TIRAMON_HIT_RATE_SHOOT = [
    ["完全に読み切られている！！！"],
    ["読まれている！！"],
    ["警戒されている！"],
    ["警戒されているが…！"],
    ["僅かな隙を突いた！"],
    ["これは読んでいなかったようだ！！"],
    ["完全に予想外！！！"],
  ]

  TIRAMON_SUCCESS_ATTACK = ["が決まった！", "が決まる！", "が炸裂！", "が爆発！"]
  TIRAMON_FAIL_ATTACK = ["うまくきまらなかった！", "間一髪で決まらなかった！", "惜しい、決まらなかった！"]

  TIRAMON_WEIGHT_DAMAGE = [
    ["パワーでは分がある！"],
    ["パワーで圧倒する！！"],
    ["圧倒的な体格差！！！"],
  ]
  TIRAMON_KIAI_DAMAGE = [
    ["あまり力が入っていない…！", "なんとか力を振り絞る…！"],
    ["力のこもった一撃！"],
    ["全力の一撃！！"],
    ["気合を振り絞った一撃！！！", "渾身の一撃！！！", "この一撃にすべてを賭ける！！！"],
  ]
  TIRAMON_RANDOM_DAMAGE = [
    ["クリティカルヒット！", "うまく決まった！"],
    ["クリティカルヒット！！"],
    ["クリティカルヒット！！！", "クリティカルヒット！！！", "クリティカルヒット！！！", "クリティカルヒット！！！", "闘魂爆発！！！"],
  ]
  TIRAMON_DAMAGE = [
    ["全く効いていない！！！"],
    ["効いているようだ！！"],
    ["着実に効いている！"],
    ["効いている…！"],
    ["すごく効いている！"],
    ["ものすごく効いている！！"],
    ["痛恨の一撃！！！"],
    ["終わった……！！！"],
  ]

  TIRAMON_MOVE = ["が動いた！", "が仕掛ける！", "が攻める！"]
  TIRAMON_TIRED = ["は疲れて動けない…！", "ががっくりと膝をつく…！", "はスタミナ切れのようだ…！"]
  TIRAMON_DOUBLE_DOWN = ["お互いに倒れて動けない…！", "ダブルダウン…！", "どちらが先に動けるか…！", "死闘の果てに、一体どちらが勝利を掴むのか…！"]

  TIRAMON_GIVE_UP = ["はギブアップ！！！", "は戦闘不能！！！", "はレフェリーの判断で戦闘不能とみなされた！！！", "陣営からタオルが投げ込まれた！！！"]
  TIRAMON_GUTS = ["は根性で踏みとどまった！！！", "はまだ戦える！！！", "は精根尽き果て、なおまだ闘う！！！", "はなぜまだ闘えるのか！！！", "は倒れることを良しとしない！！！" ]
end
