module Constants
  TRANSLATE_LANGUAGE = ["ja", "en", "zh"]

  NOTICE_RETENTION_PERIOD = 7.days
  MESSAGE_RETENTION_PERIOD = 30.days

  DISTRIBUTE_RATIO = 0.005
  DISTRIBUTE_MIN = 100
  TAX_RATIO = 0.01
  TAX_MIN = 1

  PREMIUM_PRICE = 50000
  PREMIUM_LIMIT = 1.days

  STOCK_COMPANY_NAME_ELEMENTS = ["", "ニュース", "サービス", "スクラッチ", "テクノロジー", "ナビ", "オープン", "ロボティクス", "ネットワーク",
    "ネットワークス", "ヒューマン", "インタラクティブ", "マーケット", "マーケティング", "プラネット", "コネクテッド", "メディア",
    "マイスター", "ネクスト", "バイオ", "ケミカル", "テック", "フォース", "アセット", "ナレッジ", "マーチャント", "ワークス", "スタンダード",
    "エージェント", "マネー", "インサイド", "リンク", "アンド", "モチベーション", "スタイル", "デザイン", "ペイ", "ジャパン", "パワー",
    "マテリアル", "デバイス", "オプティ", "マインド", "ネット", "ビット", "エナジー", "キャリア", "ヘルスケア", "ピクセル",
    "スペース", "フィールド", "スマート", "ドライブ", "システム", "システムズ", "リンク", "サイエンス", "クレジット", "ワークス", "コム",
    "ケミカル", "コンセプト", "インフォ", "インターネット", "イー", "デジタル", "クリエイト", "クラウド", "フューチャー", "ユニバーサル" ]

  STOCK_COMPANY_NAME_ELEMENTS_AFTER = ["工業", "興業", "鋼業", "化学", "電力", "研究所", "交通", "証券",
    "ホールディングス", "グループ", "カンパニー", "コーポレーション", "キャピタル", "サービス", "ペイ", "ラボ",
    "モバイル", "エンジニアリング", "リテイリング", "バンク", "ドットコム", "エンターテインメント"]

  CARD_ZOMBIE = "ゾンビー"
  CARD_PRICE = 1000
  CARD_PACK = 5
  CARD_BOX_EXPAND_PRICE = 1000
  CARD_JUDGE_PRICE = 1000

  CARD_PRIZE = 1000
  CARD_DESTROY_RATIO = 0.2
  CARD_HOF_COUNT = 30

  CARD_RULE = [300, 200, 100]
  CARD_RULE_NAME = ["スーパーヘビー級", "ヘビー級", "ジュニア級"]
  CARD_ELEMENTS = ["無", "木", "火", "土", "金", "水", "光", "闇", "全", "？", "虚", "神"]
  CARD_ELEMENTALS = ["カオス", "青龍", "朱雀", "麒麟", "白虎", "玄武", "アマテラス", "ツクヨミ", "コスモス", "正体不明", "真理", "宣言"]

  CARD_EFFFECT = [ [0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0],
                   [0, 0,-1, 1, 0, 0, 1, 0, 0, 1, 1, 0],
                   [0, 0, 0,-1, 1, 0, 1, 0, 0, 1, 1, 0],
                   [0, 0, 0, 0,-1, 1, 1, 0, 0, 1, 1, 0],
                   [0, 1, 0, 0, 0,-1, 1, 0, 0, 1, 1, 0],
                   [0,-1, 1, 0, 0, 0, 1, 0, 0, 1, 1, 0],
                   [0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1, 0],
                   [0, 1, 1, 1, 1, 1, 0, 0, 0, 1, 1, 0],
                   [0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0],
                   [-1,-1,-1,-1,-1,-1,-1,-1,-1, 0,-1,-1],
                   [0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1],
                   [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0] ]

  CARD_ENVIRONMENT = [ [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
                       [0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
                       [0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0],
                       [0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0],
                       [0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0],
                       [0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0],
                       [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
                       [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
                       [0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0],
                       [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
                       [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
                       [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] ]
end
